#### Day objectives:
        - Pandas

##### Pandas:
    - pandas is a fast,powerful,flexible and easy to use open source data analysis library.
    - pandas is a python library used for working on datasets.
    - it has functions for analyzing,cleaning,exploring and manipulating data.
    - the default dimensions size of pandas library is 64
    
##### library installation:
         - pip install library name
                    ex: pip install pandas
            
##### library usage:
         import pandas

In [1]:
pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\programdata\anaconda3\lib\site-packages (1.4.4)
Requirement already satisfied: numpy>=1.18.5 in c:\programdata\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: pytz>=2020.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\programdata\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: six>=1.5 in c:\programdata\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd

In [5]:
pd.__version__

'1.4.4'

##### Pandas DataStructures:
    - pandas contains two different data structures:
                - pandas Series
                - pandas DataFrame

#### Pandas Series:
    - it is a one dimensional array holding the data of any type
    - syntax:
        pd.Series([list,tuple,dict,array])

In [8]:
##### how to create pandas Series by using list:
li=[34,56,67,89.56,"numpy",12,23]
print(li)
print(type(li))
s1=pd.Series(li)
s1

[34, 56, 67, 89.56, 'numpy', 12, 23]
<class 'list'>

0       34
1       56
2       67
3    89.56
4    numpy
5       12
6       23
dtype: object

In [12]:
print(s1)
print(s1[4])
print(s1[:4])
print(s1[::-1])

0       34
1       56
2       67
3    89.56
4    numpy
5       12
6       23
dtype: object
numpy
0       34
1       56
2       67
3    89.56
dtype: object
6       23
5       12
4    numpy
3    89.56
2       67
1       56
0       34
dtype: object

#### how to change index in series:
            - pd.index

In [13]:
s1

0       34
1       56
2       67
3    89.56
4    numpy
5       12
6       23
dtype: object

In [16]:
s1.index=['a','b','c','d','e','f','g']
s1

a       34
b       56
c       67
d    89.56
e    numpy
f       12
g       23
dtype: object

In [19]:
print(s1)
print(s1['a'])
print(s1['c':'g'])

a       34
b       56
c       67
d    89.56
e    numpy
f       12
g       23
dtype: object
34
c       67
d    89.56
e    numpy
f       12
g       23
dtype: object

In [22]:
##### how to create pandas series by using tuple:
t=(56,12,34,45,"tuple","pandas",49)
print(t)
print(type(t))
s2=pd.Series(t)
s2

(56, 12, 34, 45, 'tuple', 'pandas', 49)
<class 'tuple'>

0        56
1        12
2        34
3        45
4     tuple
5    pandas
6        49
dtype: object

In [24]:
print(s2[:])
print(s2[::-1])

0        56
1        12
2        34
3        45
4     tuple
5    pandas
6        49
dtype: object
6        49
5    pandas
4     tuple
3        45
2        34
1        12
0        56
dtype: object

In [26]:
##### How to create pandas series by using dictionary:
d={'name':'srikanya','rollno':678,'branch':'cse','Section':'A','cgpa':9.0}
print(d)
print(type(d))

{'name': 'srikanya', 'rollno': 678, 'branch': 'cse', 'Section': 'A', 'cgpa': 9.0}
<class 'dict'>

In [27]:
s3=pd.Series(d)
s3

name       srikanya
rollno          678
branch          cse
Section           A
cgpa            9.0
dtype: object

In [30]:
print(s3['branch'])
print(s3['name'])
print(s3['Section'])

cse
srikanya
A

In [31]:
# how to create pandas series by using numpy
import numpy as np

In [35]:
a=np.arange(21,31)
print(a)
print(type(a))
s4=pd.Series(a)
print(s4)
print(type(s4))

[21 22 23 24 25 26 27 28 29 30]
<class 'numpy.ndarray'>
0    21
1    22
2    23
3    24
4    25
5    26
6    27
7    28
8    29
9    30
dtype: int32
<class 'pandas.core.series.Series'>

#### dates_range:
        - pd.date_range(stat_date,end_date)

In [36]:
print(dir(pd))

['BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Flags', 'Float32Dtype', 'Float64Dtype', 'Float64Index', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int64Index', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt64Index', 'UInt8Dtype', '__all__', '__builtins__', '__cached__', '__deprecated_num_index_names', '__dir__', '__doc__', '__docformat__', '__file__', '__getattr__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_is_numpy_dev', '_libs', '_testing', '_typing', '_version', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'read_xml', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [37]:
dates=pd.date_range(start='2024-09-01',end='2024-09-30')
dates

DatetimeIndex(['2024-09-01', '2024-09-02', '2024-09-03', '2024-09-04',
               '2024-09-05', '2024-09-06', '2024-09-07', '2024-09-08',
               '2024-09-09', '2024-09-10', '2024-09-11', '2024-09-12',
               '2024-09-13', '2024-09-14', '2024-09-15', '2024-09-16',
               '2024-09-17', '2024-09-18', '2024-09-19', '2024-09-20',
               '2024-09-21', '2024-09-22', '2024-09-23', '2024-09-24',
               '2024-09-25', '2024-09-26', '2024-09-27', '2024-09-28',
               '2024-09-29', '2024-09-30'],
              dtype='datetime64[ns]', freq='D')

#### Pandas DataFrame:
    - pandas DataFrame is a two dimensional size tabular data(row,columns)
    - syntax:
            pd.DataFrame(list....)

In [38]:
li2=[[1,2,4,5],[45,56,67,78],[89,90,23,12]]
df=pd.DataFrame(li2)
df

    0   1   2   3
0   1   2   4   5
1  45  56  67  78
2  89  90  23  12

In [39]:
type(df)

pandas.core.frame.DataFrame

In [40]:
df.index=['row1','row2','row3']
df

       0   1   2   3
row1   1   2   4   5
row2  45  56  67  78
row3  89  90  23  12

In [41]:
df.columns=['c1','c2','c3','c4']
df

      c1  c2  c3  c4
row1   1   2   4   5
row2  45  56  67  78
row3  89  90  23  12

In [42]:
d2={'name':['siri','giri','vani'],
     'roll':[678,789,980],
      'branch':['cse','ece','mech'],
       'section':['A','B','C']}
d2

{'name': ['siri', 'giri', 'vani'],
 'roll': [678, 789, 980],
 'branch': ['cse', 'ece', 'mech'],
 'section': ['A', 'B', 'C']}

In [43]:
df2=pd.DataFrame(d2)
df2

   name  roll branch section
0  siri   678    cse       A
1  giri   789    ece       B
2  vani   980   mech       C

In [44]:
df2.columns=['NAME','ROLL','BRANCH','SECTION']
df2

   NAME  ROLL BRANCH SECTION
0  siri   678    cse       A
1  giri   789    ece       B
2  vani   980   mech       C

In [45]:
df2.index=['r1','r2','r3']
df2

    NAME  ROLL BRANCH SECTION
r1  siri   678    cse       A
r2  giri   789    ece       B
r3  vani   980   mech       C

##### Pandas Operations on DataSet
        - DataSet Reading
        - DataSet indexing
        - DataSet sorting
        - DataSet Filtering
        - Mathematical and Statistical Operations on DataSet
        - Dataset Cleaning
        - Dataset saving
        - DataSet Plotting

- Dataset
    - kaggle.com
            - dataset name:
                    - birds bones and living habits
                    - titanic dataset analysis

### DataSet Reading
        - pd.read_csv('filename.csv')
        - pd.read_excel('filename.xlsx')

In [47]:
bird=pd.read_csv('bird.csv')
bird

,id,huml,humw,ulnal,ulnaw,feml,femw,tibl,tibw,tarl,tarw,type
0,0,80.78,6.68,72.01,4.88,41.81,3.70,5.50,4.03,38.70,3.84,SW
1,1,88.91,6.63,80.53,5.59,47.04,4.30,80.22,4.51,41.50,4.01,SW
2,2,79.97,6.37,69.26,5.28,43.07,3.90,75.35,4.04,38.31,3.34,SW
3,3,77.65,5.70,65.76,4.77,40.04,3.52,69.17,3.40,35.78,3.41,SW
4,4,62.80,4.84,52.09,3.73,33.95,2.72,56.27,2.96,31.88,3.13,SW
...,...,...,...,...,...,...,...,...,...,...,...,...
415,415,17.96,1.63,19.25,1.33,18.36,1.54,31.25,1.33,21.99,1.15,SO
416,416,19.21,1.64,20.76,1.49,19.24,1.45,33.21,1.28,23.60,1.15,SO
417,417,18.79,1.63,19.83,1.53,20.96,1.43,34.45,1.41,22.86,1.21,SO
418,418,20.38,1.78,22.53,1.50,21.35,1.48,36.09,1.53,25.98,1.24,SO
419,419,17.89,1.44,19.26,1.10,17.62,1.34,29.81,1.24,21.69,1.05,SO

In [48]:
titanic=pd.read_csv('titanic.csv')
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [49]:
# head()-it returns top 5 rows from the dataset
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [50]:
# tail()-it returns last 5 rows from the dataset
titanic.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [54]:
# sample-it returns random row at a time from the dataset
bird.sample()

      id   huml  humw  ulnal  ulnaw   feml  femw  tibl  tibw   tarl  tarw type
335  335  22.35  2.01  25.13   1.85  21.98  1.69  36.5  1.71  26.42  1.52   SO

In [56]:
titanic.sample(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
326,327,0,3,"Nysveen, Mr. Johan Hansen",male,61.0,0,0,345364,6.2375,NaN,S
144,145,0,2,"Andrew, Mr. Edgardo Samuel",male,18.0,0,0,231945,11.5000,NaN,S
483,484,1,3,"Turkula, Mrs. (Hedwig)",female,63.0,0,0,4134,9.5875,NaN,S
347,348,1,3,"Davison, Mrs. Thomas Henry (Mary E Finck)",female,NaN,1,0,386525,16.1000,NaN,S
666,667,0,2,"Butler, Mr. Reginald Fenton",male,25.0,0,0,234686,13.0000,NaN,S

In [58]:
# size()
titanic.size

10692

In [59]:
bird.size

5040

In [60]:
# index()
bird.index

RangeIndex(start=0, stop=420, step=1)

In [61]:
titanic.index

RangeIndex(start=0, stop=891, step=1)

In [63]:
# columns()
bird.columns

Index(['id', 'huml', 'humw', 'ulnal', 'ulnaw', 'feml', 'femw', 'tibl', 'tibw',
       'tarl', 'tarw', 'type'],
      dtype='object')

In [64]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')